# DBeam_GetLastObject

## Description
Return the most recently created beam object

```pascal
FUNCTION DBeam_GetLastObject : HANDLE;
```

```python

def vs.DBeam_GetLastObject():
    return HANDLE
```

## Version
Availability: from Vectorworks 2011
## Category
* Spotlight